Core/src/Catalogs/ШаблоныКалькуляций/ШаблоныКалькуляций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ШаблоныКалькуляций</name>
  <attributes>
    <name>ДатаРасчетаСебестоимости</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизацияСебестоимости</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчетнаяСебестоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Запасы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Спецификация</name>
      <type>
        <types>CatalogRef.Спецификации</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РасчетнаяСебестоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Расходы</name>
    <attributes>
      <name>Расход</name>
      <type>
        <types>ChartOfAccountsRef.Управленческий</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособРасчета</name>
      <type>
        <types>EnumRef.СпособыРасчетаСуммыЗатрат</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РасходРегл</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Core/src/Enums/СпособыРасчетаСуммыЗатрат/СпособыРасчетаСуммыЗатрат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыРасчетаСуммыЗатрат</name>
  <enumValues>
    <name>ФиксированнаяСумма</name>
  </enumValues>
  <enumValues>
    <name>ПроцентОтСуммыПродажи</name>
  </enumValues>
  <enumValues>
    <name>ПроцентОтПрибыли</name>
  </enumValues>
</mdclass:Enum>

Core/src/Catalogs/ШаблоныКалькуляций/ObjectModule.bsl
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	УчетПоВалютам = ПолучитьФункциональнуюОпцию("УчетВалютныхОпераций");
	ВалютаУчета = Константы.ВалютаУчета.Получить();
	Ошибки = Неопределено;
	
	Для каждого Стр Из Расходы Цикл
		Если Стр.СпособРасчета=Перечисления.СпособыРасчетаСуммыЗатрат.ФиксированнаяСумма И НЕ ЗначениеЗаполнено(Стр.Валюта) Тогда
			Если УчетПоВалютам Тогда
				Индекс = Расходы.Индекс(Стр);
				ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(
				Ошибки, 
				"Расходы.Валюта",,
				"Расходы.Валюта",
				Индекс,
				НСтр("ka='Не указана валюта в строке %1';ru='Не указана валюта в строке %1'"),
				Индекс);
			Иначе
				Стр.Валюта = ВалютаУчета;
			КонецЕсли; 
		КонецЕсли; 
	КонецЦикла;
	
	Если НЕ Ошибки=Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки, Отказ);
	КонецЕсли; 
	
	//+++ Дмгг
	ИспользоватьТолькоРегламентированныйПланСчетов = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИспользованиеТолькоРегламентированногоПланаСчетов(ТекущаяДата()); //+++ Дмгг
	Если ИспользоватьТолькоРегламентированныйПланСчетов Тогда 
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "Расходы.Расход");
	Иначе
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "Расходы.РасходРегл");
	КонецЕсли;
	//--- Дмгг
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	// Обновление реквизита КлючСвязи
	
	КлючСвязи = 0;
	Для каждого Стр Из Запасы Цикл
		КлючСвязи = Макс(КлючСвязи, Стр.КлючСвязи); 
	КонецЦикла; 
	Для каждого Стр Из Расходы Цикл
		КлючСвязи = Макс(КлючСвязи, Стр.КлючСвязи); 
	КонецЦикла;
	
	Для каждого Стр Из Запасы Цикл
		Если Стр.КлючСвязи=0 Тогда
			КлючСвязи = КлючСвязи+1;
			Стр.КлючСвязи = КлючСвязи;
		КонецЕсли; 
	КонецЦикла; 
	Для каждого Стр Из Расходы Цикл
		Если Стр.КлючСвязи=0 Тогда
			КлючСвязи = КлючСвязи+1;
			Стр.КлючСвязи = КлючСвязи;
		КонецЕсли; 
	КонецЦикла; 
	
КонецПроцедуры
